/***************************************************
 * ОПИСАНИЕ СКЕТЧА
 **************************************************

 ***************************************************/

//Подключаем вкладки
#include "Variables.h"     // Подключаем вкладку с переменными
#include "Blynk.h"         // Подключаем вкладку Blynk
#include "notifications.h" // Подключаем уведомлений датчика
#include "Sensor.h"        // Подключаем вкладку далласов
#include "Sensntc.h"       // Подключаем вкладку термистора
#include <stdint.h>



void setup() {
  pinMode(RELE1, OUTPUT);
  Serial.begin(9600);  //консоль отладки
  Serial.println("3D Print control");
 
//Стартуем цифровые датчики  
  sensorStart();

//Стартуем термистор  
  ntcStart();  

// Стартуем блинк
  setupBlynk();
}


  // функции в цикле
void loop() {
      readTemp(); // читаем температуру с датчиков 
      ntcRead(); // читаем температуру с термистора
      loopBlynk();
}
